# Terminal tools
brew "starship"
brew "fzf"
brew "fd"
brew "ripgrep"
brew "lazygit"
brew "carapace"
brew "zoxide"
brew "yazi"
brew "tmux"
brew "neovim"
brew "git"
brew "gh"
brew "jq"
brew "node"
brew "imagemagick"

# CLI tools referenced in .zshrc aliases
brew "terraform"
brew "kubernetes-cli"

# Casks
cask "wezterm"
cask "font-jetbrains-mono-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-roboto-mono-nerd-font"
